'''
拯救圆周率

魔鬼为了阻止人类进步，将数学瑰宝圆周率占为己有。为了满足它的私欲，魔鬼对圆周率的前99位进行肆意篡改。

现在你偷偷潜入了魔鬼的地穴，需要凭借智慧和利器 Python 将圆周率恢复。

已知：

1）魔鬼最喜欢的数字是"6" ，所以它将圆周率中的"6"都取走，并以"6" 为截点将圆周率切割，形成了一个"破碎的圆周率"，装在列表 broken_pi 之中；

2）魔鬼最害怕的数字是 "9"，所以它将圆周率中的"9"都换成了空字符 " "；

3）broken_pi 已被魔鬼打上了符咒，你需要从中取出碎片，才能对其进行恢复。
'''


# 我用 Python 拯救了圆周率
broken_pi = ["3.1415 2","5358 7 32384","2","4338327 5028841 71"," 3  375105820 74 445 230781","40","28","208  8","280348253421170"]
pi = "6".join(broken_pi) # 用"6" 将broken_pi中的碎片联结起来
pi = pi.replace(" ","9") # 将pi中的" "替换成"9"
print(pi)
