# 画一只喵星人
#步骤1:点击“运行”
#看看这只猫缺了什么部分？
cat=""                              
cat1 = "       ;=    / /=\  t"
cat2 = "     =\  t  ;=    / /"
cat3 = " =    /    =\  t  ; /"

print("                     _")
print("                    / )")
print("                   ( (")
print("       A.-.A  .-""-.  ) )")
print("      / , , \/    \/ /")
# 步骤2:将下方 print(cat) 中的cat 替换为 cat1、cat2 或 cat3
# 分别点击运行后，看看哪个部分更合适？
print(cat2)                         
print("       `--,'  .  ／/")
print("         || |  \\  \ ")
print("        ((,_|  ((,_\  ")
print("-^-^ ^-^-^-^-^-^-^-^-^-^-")
 # 步骤3:将下方 扇贝编程 改为自己的名字，大功告成！
my_name = "洋阳"                
print("     《Python画喵》 By " + my_name)
 # 点击运行，看看自己的作品吧！
