'''
摩斯电码（Morse Code）是一种时断时续的信号，通过不同的排列顺序表达不同的英文字母、数字和标点符号。
请模仿下方“小明”的示范，输出你名字字母的摩斯密码；
小明的名字字母为 XIAOMING。
'''

# 我用 Python 生成摩斯密码
# 字母之间需要保留空格
A = '.-'
B = '-...'
C = '-.-.'
D = '-..'
E = '.'
F = '..-.'
G = '--.'
H = '....'
I = '..'
J = '.---'
K = '-.-'
L = '.-..'
M = '--'
N = '-.'
O = '---'
P = '.--.'
Q = '--.-'
R = '.-.'
S = '...'
T = '-'
U = '..-'
V = '...-'
W = '.--'
X = '-..-'
Y = '-.--'
Z = '--..'
print("“小明”的摩斯密码是：")
print(X+' '+I+' '+A+' '+O+' '+M+' '+I+' '+N+' '+G)
print("我名字的摩斯密码是：")
# 下面请参照上方示例，让程序输出你名字的摩斯密码
print(Y+' '+A+' '+N+' '+G+' '+Y+' '+A+' '+N+' '+G)
