'''
menu 中是某家外卖提供的菜单，其中写明了每道菜或主食对应的卡路里数。

order 中是今晚你打算点的菜或主食。

如果你想点的菜在menu中存在，那么请为 sum_cal 加上相应的卡路里数；

如果menu中没有你想点的菜或主食，用 .get() 方法返回 0，代表今晚你没有摄入相应数值的卡路里。

请输出你今天晚餐的卡路里sum_cal是多少。
'''



menu = {
  "鸡蛋1只": 72, 
  "苹果1个": 95, 
  "麦片1杯": 195, 
  "烤鸭肉半只": 445, 
  "白饭1碗": 220, 
  "炒青菜": 165, 
  "蛋花汤1碗": 70, 
  "奶茶1杯": 250, 
  "虾100克": 200, 
  "荷兰豆100克": 32, 
  "青椒100克": 14, 
  "面1碗": 280
}
order = ["烤鸭肉半只","蛋花汤1碗","荷兰豆100克","西红柿100克","白饭1碗"]
sum_cal = 0
for food in order:
    sum_cal += menu.get(food,0)
print(sum_cal)
