# -*- coding: utf-8 -*-
"""
Created on Sat Jun 29 11:17:15 2019

@author: Administrator
"""



# 数字转字符串
str(3820594)
# '3820594'

# 字符串转列表（数字不能直接转列表）
list('3820594')  
# ['3', '8', '2', '0', '5', '9', '4']

# 列表转元组
tuple(list('3820594'))
# ('3', '8', '2', '0', '5', '9', '4')

# 元组转列表
list(tuple('3820594'))
# ['3', '8', '2', '0', '5', '9', '4']

# 元组转字符串
number = ('3', '8', '2', '0', '5', '9', '4')
"".join(number)
# '3820594'

# 列表转字符串
number = ['3', '8', '2', '0', '5', '9', '4']
"".join(number)
# '3820594'